import React from 'react'
import common from 'widget/common'

var __html = `鲜在时与用户共同确认：

1. 用户点击鲜在时注册页面的同意注册按钮并完成注册程序、获得鲜在时账号和密码时，视为用户与鲜在时已达成《鲜在时用户协议》，就用户进入鲜在时消费达成本协议的全部约定。

2. 鲜在时及用户均已认真阅读本《鲜在时用户协议》(下称“本协议”)中全部条款（特别是以黑体字标示出的关于鲜在时及用户重大权益的条款）及鲜在时发布的其他全部服务条款和操作规则的内容，对本协议及前述服务条款和规则均以知晓、理解并接受，同意将其作为确定双方权利义务的依据。鲜在时《法律声明》为本协议的必要组成部分，用户接受本协议的同时即视为接受鲜在时《法律声明》的全部内容。

一、定义条款

1.1.“鲜在时”：杭州鲜在时网络科技有限公司，域名为www.xianzaishi.com, 杭州鲜在时网络科技有限公司通过该网络交易平台为用户提供商品交易的网络交易平台服务。本协议下文中，“鲜在时”既指网络交易平台（www.xianzaishi.com），亦指杭州鲜在时网络科技有限公司。
1.2.“用户”：接受并同意本协议全部条款及鲜在时发布的其他全部服务条款和操作规则、通过鲜在时进行交易的鲜在时注册会员。
1.3.“交易”：用户与鲜在时进行的交易商品/服务的活动。


二、用户注册

2.1.注册资格
用户承诺：用户具有完全民事权利能力和行为能力或虽不具有完全民事权利能力和行为能力但经其法定代理人同意并由其法定代理人代理注册及应用鲜在时服务。

2.2.注册目的
用户承诺：用户进行用户注册并非出于违反法律法规或破坏鲜在时网络交易秩序的目的。

2.3.注册流程
2.3.1.用户同意根据鲜在时用户注册页面的要求提供有效手机号码、账户密码，设置鲜在时账号及密码，用户应确保所提供全部信息的真实性、完整性和准确性。
2.3.2.用户合法、完整并有效提供注册所需信息的，有权获得鲜在时账号和密码，鲜在时账号和密码用于用户在鲜在时进行会员登录。
2.3.4.用户获得鲜在时账号及密码时视为用户注册成功，用户同意接收鲜在时发送的与鲜在时网站管理、运营相关的电子邮件和/或短消息。


三、用户服务

3.1.服务内容
3.1.1.用户有权在鲜在时浏览团购商品/服务的信息、有权和鲜在时达成订单、支付价款等。
3.1.2.用户有权在鲜在时查看其鲜在时会员账号下的信息，有权应用鲜在时提供的功能进行操作。
3.1.3.用户有权按照鲜在时发布的活动规则参与鲜在时组织的网站活动。
3.1.4.鲜在时承诺为用户提供的其他服务。
3.2.服务规则
用户承诺遵守下列鲜在时服务规则：

3.2.1.用户应当遵守法律法规、规章、规范性文件及政策要求的规定，不得在鲜在时或利用鲜在时服务从事非法或其他损害鲜在时或第三方权益的活动，如发送或接收任何违法、违规、违反公序良俗、侵犯他人权益的信息，发送或接收传销材料或存在其他危害的信息或言论，未经鲜在时授权使用或伪造鲜在时电子邮件题头信息等。
3.2.2.用户应当遵守法律法规应当妥善使用和保管鲜在时账号及密码，对其鲜在时账号和密码下进行的行为和发生的事件负责。当用户发现鲜在时账号被未经其授权的第三方使用或存在其他账号安全问题时应立即有效通知鲜在时，要求鲜在时暂停该鲜在时账号的服务。鲜在时有权在合理时间内对用户的该等请求采取行动，但对采取行动前用户已经遭受的损失不承担任何责任。用户在未经鲜在时同意的情况下不得将鲜在时账号以赠与、借用、租用、转让或其他方式处分给他人。
3.2.3.用户通过鲜在时与商家进行团购交易时，应当遵守本协议“交易规则”的全部约定及鲜在时发布的其他关于交易的服务条款和操作规则的全部规定。
3.2.4.用户在鲜在时商品/服务进行评价时应当根据实际情况如实进行评价。
3.2.5.用户应当按照鲜在时发布的规则参加鲜在时抽奖等活动，遵守活动秩序。
3.2.6.鲜在时发布的其他服务条款和操作规则。


四、交易规则

用户承诺在其进入鲜在时消费，遵守如下鲜在时交易规则。

4.1.浏览团购信息
用户在鲜在时浏览团购商品/服务的团购信息时，应当仔细阅读团购信息中包含的全部内容，包括但不限于团购商品/服务的名称、种类、数量、质量、价格、有效期、预约时间、商家地址、营业时间、配送方式、退换货方式、退款条件、售后服务等内容，其中用户应特别注意团购商品/服务的有效期、预约时间及退款条件等内容，用户完全接受信息中包含的全部内容后方可点击购买。

4.2.提交及确认订单
4.2.1.用户应当仔细阅读订单页面中所包含的全部内容，包括但不限于信息中的全部内容、为再次提示用户注意而标明的本单商品/服务的有效期、退款条件等内容（如有），选择及确认购买数量、价格、应付总额、用户接收团购电子消费凭证的联系方式或接收货物的收货地址和送货时间等内容。
前述团购订单页面中所包含的全部内容，构成了用户与商家之间达成的团购合同的合同内容，用户完全同意团购订单的全部内容后方可提交订单。
4.2.2.用户再次阅读并确认订单的全部内容后方可点击确认订单并付款，用户确认订单即视为用户已知晓、同意并接受订单中的全部内容。订单中所包含的全部内容即为合同的内容，具体包括但不限于团购商品/服务的名称、种类、数量、质量、价格、有效期、预约时间、商家地址、营业时间、配送方式、退换货方式、退款条件、售后服务等，用户与鲜在时均应当按照前述团购合同的约定履行各自的权利义务。
4.3.支付价款
在团购合同成立之后用户应根据付款页面的提示通过网上支付平台完成价款的支付。

4.5.退款规则
用户支付团购价款成功后，需要进行退款的，按照如下规则进行：

4.5.1.发生以下情形之一的，用户有权要求鲜在时进行退款：
4.5.1.2.用户付款成功后，因不可抗力或商家原因，导致无法向用户提供商品/服务，经鲜在时核实后属实的；
4.5.1.3.用户付款成功后，因确属情况变化导致需要变更合同内容，用户不接受变更后内容的。
4.5.2.用户已实际消费团购商品/服务的，无权要求求鲜在时代进行退款，但商品/服务与合同约定内容严重不符、存在其他严重质量问题或违反《网络交易管理办法》、《中华人民共和国食品安全法》、《中华人民共和国消费者权益保护法》的除外。
4.5.3.团购合同约定的有效期届满但用户未在有效期内进行消费的，是否及如何退款应根据团购合同的约定确定。根据团购合同的约定用户有权要求退款的，用户应按照团购合同的约定要求鲜在时代商家进行退款，在此种情况下如用户但未向鲜在时要求退款的，即视为用户放弃了主张退款的权利，鲜在时有权保留及处理此等款项。
4.5.4.在鲜在时中明确标明“不支持未消费随时退款”的产品或服务；
4.5.5.其他情形下的退款按照合同内容约定的退款条件及退款方式进行。
4.5.6.在退款进行过程中，用户应当遵守鲜在时关于退款的服务条款和操作规则的规定。


五、用户的权利和义务

5.1.用户有权按照本协议约定接受鲜在时提供的鲜在时网络交易平台服务。
5.2.如用户要求获得商品/服务的发票、其他付款凭证、购货凭证或服务单据，有权且应当在对团购商品/服务进行消费时向商家提出，发票金额以实际支付的价款为准。
5.3.用户在消费商品/服务的过程中，如发现商品/服务与订单内容不符或存在质量、服务态度等其他问题的，应与鲜在时采取协商或其他方式予以解决。
5.4.用户有权随时终止使用鲜在时服务。
5.5.用户应保证其在注册时和提交订单时所提供的姓名、联系方式、联系地址等全部信息真实、完整、准确，并当上述信息发生变更时及时进行更新提供给鲜在时的信息。
5.6.用户在鲜在时进行交易时不得恶意干扰交易的正常进行、破坏鲜在时交易秩序。
5.7.用户不得以任何技术手段或其他方式干扰鲜在时的正常运行或干扰其他用户对鲜在时服务的使用。
5.8.用户不得以虚构事实等方式恶意诋毁鲜在时或商家的商誉。
5.9.用户不得对团购商品/服务进行虚假评价或虚假投诉。


六、鲜在时的权利和义务

6.1.如用户不具备本协议约定的注册资格，则鲜在时有权拒绝用户进行注册，对已注册的用户有权注销其鲜在时会员账号，鲜在时因此而遭受损失的有权向前述用户或其法定代理人主张赔偿。同时，鲜在时保留其他任何情况下决定是否接受用户注册的权利。
6.2.鲜在时发现账户使用者并非账户初始注册人时，有权中止该账户的使用。
6.3.鲜在时通过技术检测、人工抽检等检测方式合理怀疑用户提供的信息错误、不实、失效或不完整时，有权通知用户更正、更新信息或中止、终止为其提供鲜在时服务。
6.4.鲜在时有权在发现鲜在时上显示的任何信息存在明显错误时，对信息予以更正。
6.5.用户付款成功前，鲜在时有权接受商家委托对订单内容作出变更，如用户接受变更后的内容则用户可确认订单及付款，如用户不接受变更后内容则有权取消订单。用户付款成功后，如确因情况变化导致商家需对订单内容作出变更的，鲜在时有权接受商家委托单方对订单内容作出变更，如用户接受变更则按变更后的订单内容进行消费，如用户不接受变更则用户有权取消订单并要求鲜在时代商家全额退款。
6.6.鲜在时保留修改、中止或终止鲜在时服务的权利，鲜在时行使前述权利将按照法律规定的程序及方式告知用户。
6.7.鲜在时应当采取必要的技术手段和管理措施保障鲜在时的正常运行，并提供必要、可靠的交易环境和交易服务，维护团购交易秩序。
6.8.鲜在时有权在本协议履行期间及本协议终止后保留用户的注册信息及用户应用鲜在时服务期间的全部交易信息，但不得非法使用该等信息。
6.9.鲜在时有权随时删除鲜在时网站内各类不符合国家法律法规、规范性文件或鲜在时网站规定的用户评价等内容信息，鲜在时行使该等权利不需提前通知用户。


七、用户信息

7.1.在遵守法律的前提下，为向用户提供优质、便捷的服务，当用户注册鲜在时账户时，或访问鲜在时站及其相关网站、鲜在时移动设备客户端时，或使用鲜在时提供的服务时，鲜在时可能会记录用户操作的相关信息或采集用户的以下信息：
7.1.1在用注册鲜在时账户及使用鲜在时提供的各项服务时，为识别用户的身份，可能要向鲜在时提供一些个人信息（包括但不限于姓名、身份证明、地址、电话号码、电子邮件地址等信息及相关附加信息（如您所在的省份和城市、邮政编码等））。
7.1.2如用户使用的鲜在时服务需与用户的银行账户或其他支付工具的账户关联方能实现时，用户需要向鲜在时提供用户的银行账户信息或其他支付工具的账户信息。
7.1.3为便于用户查询自己的交易状态或历史记录，鲜在时会保存用户使用鲜在时服务产生的交易信息。
7.1.4为更好地识别用户的身份以充分保护用户的账户安全，当用户访问鲜在时站及其相关网站、鲜在时移动设备客户端时，或使用鲜在时提供的服务时，鲜在时可能会记录用户操作的相关信息，包括但不限于用户的计算机IP地址、设备标识符、硬件型号、操作系统版本、用户的位置以及与鲜在时服务相关的日志信息。
7.1.5.除上述信息外，鲜在时还可能为了提供服务及改进服务质量的合理需要而收集用户的其他信息，包括用户与鲜在时的客户服务团队联系时用户提供的相关信息，用户参与问卷调查时向鲜在时发送的问卷答复信息，以及用户与鲜在时及鲜在时关联公司互动时鲜在时收集的相关信息。与此同时，为提高用户使用鲜在时提供的服务的安全性，更准确地预防钓鱼网站欺诈和木马病毒，鲜在时可能会通过了解一些用户的网络使用习惯、用户常用的软件信息等手段来判断用户账户的风险，并可能会记录一些鲜在时认为有风险的URL。
7.2.为保障用户的信息安全，鲜在时一直并将继续努力采取各种合理的物理、电子和管理方面的安全措施来保护用户信息，使用户的信息不会被泄漏、毁损或者丢失，包括但不限于信息加密存储、数据中心的访问控制。鲜在时对可能接触到用户的信息的员工或外包人员也采取了严格管理，包括但不限于根据岗位的不同设置不同的权限，与员工签署保密协议等措施。
7.3.在遵守法律的前提下，为向用户提供服务及提升服务质量，鲜在时会把用户的信息用于下列用途：
7.3.1向用户提供鲜在时的各项服务及客户服务，并维护、改进这些服务。
7.3.2比较信息的准确性，并与第三方进行验证。例如，将用户向鲜在时提交的身份信息与身份验证的服务机构进行验证。
7.3.3为使用户知晓自己使用鲜在时服务的情况或了解鲜在时的服务，向用户发送服务状态的通知、营销活动及其他商业性电子信息。
7.3.4对鲜在时用户的身份数据、交易信息等进行综合统计、分析或加工，并出于团购、奖励或为了让用户拥有更广泛的社交圈的需要而使用、共享或披露；例如鲜在时可能会统计某个时间段注册鲜在时账户的新用户，对这些新用户提供专享的优惠活动。
7.3.5预防或禁止非法的活动。
7.3.6经用户许可的其他用途。
7.4.Cookie的使用
7.4.1为使用户获得更轻松的访问体验，用户访问鲜在时网站或使用鲜在时提供的服务时，鲜在时可能会通过小型数据文件识别用户的身份，帮用户省去重复输入注册信息的步骤，或者帮助判断用户的账户安全。这些数据文件可能是Cookie，Flash Cookie，或用户的浏览器或关联应用程序提供的其他本地存储（统称“Cookie”）。
7.4.2请用户理解，鲜在时的某些服务只能通过使用“Cookie”才可得到实现。如果用户的浏览器或浏览器附加服务允许，用户可以修改对Cookie的接受程度或者拒绝鲜在时的Cookie，但这一举动在某些情况下可能会影响用户安全访问鲜在时网站和使用鲜在时提供的服务。


八、特别声明

8.1.不论在何种情况下，鲜在时对由于信息网络设备维护、信息网络连接故障、电脑、通讯或其他系统的故障、电力故障、罢工、劳动争议、暴乱、起义、骚乱、生产力或生产资料不足、火灾、洪水、风暴、爆炸、战争、政府行为、司法行政机关的命令、其他不可抗力或第三方的不作为而造成的不能服务或延迟服务不承担责任。
8.2.作弊、扰乱交易秩序的情况
8.2.1除活动规则另有规定外，每次活动中，每个用户只限参加一次活动（活动包括并不限于促销优惠、秒杀、抽奖等等），每个用户只能中奖一次。同一手机、同一联系方式、同一IP地址、同一鲜在时账户、同一身份证件、同一银行卡号、同一收货地址、同一终端设备号或其他可以合理显示为同一用户的情形，均视为同一用户。
8.2.2活动期间，如发现有用户通过不正当手段（包括但不限于侵犯第三人合法权益、作弊、扰乱系统、实施网络攻击、恶意套现、刷信誉、批量注册、用机器注册鲜在时账户、用机器模拟客户端）参加活动而有碍其他用户公平参加本次活动或有违反活动目的之行为，活动举办方有权取消其获奖资格或其因参加活动所获赠品或权益。如该作弊行为给活动举办方造成损失的，活动举办方保留追究赔偿的权利。
8.2.3对于恶意进行注册，反复交易退款，侵害鲜在时实际经营交易的情况，鲜在时会停止服务、封停账号并追究责任。


九、知识产权

9.1.鲜在时所包含的全部智力成果包括但不限于数据库、网站设计、文字和图表、软件、照片、录像、音乐、声音及其前述组合，软件编译、相关源代码和软件 (包括小应用程序和脚本) 的知识产权权利均归鲜在时所有。用户不得为商业目的复制、更改、拷贝、发送或使用前述任何材料或内容。
9.2.鲜在时名称中包含的所有权利 (包括商誉和商标) 均归鲜在时所有。
9.3.用户接受本协议即视为用户主动将其在鲜在时发表的任何形式的信息的著作权，包括但不限于：复制权、发行权、出租权、展览权、表演权、放映权、广播权、信息网络传播权、摄制权、改编权、翻译权、汇编权以及应当由著作权人享有的其他可转让权利无偿独家转让给鲜在时所有，鲜在时有权利就任何主体侵权单独提起诉讼并获得全部赔偿。本协议属于《中华人民共和国著作权法》第二十五条规定的书面协议，其效力及于用户在鲜在时发布的任何受著作权法保护的作品内容，无论该内容形成于本协议签订前还是本协议签订后。
9.4.用户在使用鲜在时服务过程中不得非法使用或处分鲜在时或他人的知识产权权利。用户不得将已发表于鲜在时的信息以任何形式发布或授权其它网站（及媒体）使用。
十、客户服务

鲜在时建立专业的客服团队，并建立完善的客户服务制度，从技术、人员和制度上保障用户提问及投诉渠道的畅通，为用户提供及时的疑难解答与投诉反馈。


十一、协议的变更和终止

11.1.协议的变更
鲜在时有权对本协议内容或鲜在时发布的其他服务条款及操作规则的内容进行变更，鲜在时将按照法律规定的程序及方式发布公告。如用户继续使用鲜在时提供的服务即视为用户同意该等内容变更，如用户不同意变更后的内容则用户有权注销鲜在时账户、停止使用鲜在时服务。

11.2.协议的终止
11.2.1.鲜在时有权依据本协议约定注销用户的鲜在时账号，本协议于账号注销之日终止。
11.2.2.鲜在时有权终止全部鲜在时服务，本协议于鲜在时全部服务依法定程序及方式终止之日终止。
11.2.3.本协议终止后，用户无权要求鲜在时继续向其提供任何服务或履行任何其他义务，包括但不限于要求鲜在时为用户保留或向用户披露其原鲜在时账号中的任何信息，向用户或第三方转发任何其未曾阅读或发送过的信息等。
11.2.4.本协议的终止不影响守约方向违约方追究违约责任。


十二、违约责任

12.1.鲜在时或用户违反本协议的约定即构成违约，违约方应当向守约方承担违约责任。
12.2.如用户违反本协议约定，以转售等商业目的进行团购交易，则鲜在时有权代商家取消相关团购交易，并有权注销其鲜在时账号，终止为其提供鲜在时服务，如鲜在时因此而遭受损失的，有权要求用户赔偿损失。
12.3.如因用户提供的信息不真实、不完整或不准确给鲜在时或商家造成损失的，鲜在时有权要求用户对鲜在时或对商家进行损失的赔偿。
12.4.如因用户违反法律法规规定或本协议约定，在鲜在时或利用鲜在时服务从事非法活动的，鲜在时有权立即终止继续对其提供鲜在时服务，注销其账号，并要求其赔偿由此给鲜在时造成的损失。
12.5.如用户以技术手段干扰鲜在时的运行或干扰其他用户对鲜在时使用的，鲜在时有权立即注销其鲜在时账号，并有权要求其赔偿由此给鲜在时造成的损失。
12.6.如用户以虚构事实等方式恶意诋毁鲜在时或商家的商誉，鲜在时有权要求用户向鲜在时或商家公开道歉，赔偿其给鲜在时或商家造成的损失，并有权终止对其提供鲜在时服务。


十三、争议解决

用户与鲜在时因本协议的履行发生争议的应通过友好协商解决，协商解决不成的，任一方有权将争议提交杭州仲裁委员会依据该会仲裁规则进行仲裁。


十四、协议生效

本协议于用户点击鲜在时注册页面的同意注册并完成注册程序、获得鲜在时账号和密码时生效，对鲜在时和用户均具有约束力。
`

common.createPage(React.createClass({
  render(){
    return (
      <div style={{"padding":".3rem"}}>
        <img style={{"display":"block","margin":"0 auto",width:'9.4rem',height:'auto'}} src={require('../login/login.jpg')} />
        <h1 style={{"fontSize":".6rem","marginBottom":".6rem"}}>鲜在时用户协议</h1>
        <pre style={{"whiteSpace":"pre-wrap","fontSize":".4rem"}} dangerouslySetInnerHTML={{__html}}>
        </pre>
      </div>
    )
  }
}))
